/*3) Дан прямоугольный массив цифр (карта высот 10х10). Нужно найти локальные минимумы
 (точки, которые меньше всех своих четырех соседей вверх, вниз, влево, вправо и по диаганалям)
  (Массив: int matrix[10][10] = ... задавайте сразу в коде)*/

#include <iostream>
using namespace std;

int main(){
    setlocale(LC_ALL,"ru_RU.UTF-8");
    int matrix[10][10] ={
        {3, 4, 0, 1, 8, 2, 5, 7, 9, 3},
        {2, 5, 7, 0, 8, 9, 2, 3, 4, 1},
        {9, 1, 8, 6, 0, 2, 3, 7, 9, 2},
        {2, 8, 1, 4, 6, 3, 5, 0, 1, 3},
        {8, 3, 0, 5, 4, 7, 6, 7, 6, 2},
        {1, 4, 2, 1, 5, 8, 0, 4, 3, 9},
        {3, 2, 0, 7, 8, 2, 5, 6, 4, 5},
        {0, 1, 2, 3, 4, 5, 6, 7, 8, 9},
        {5, 4, 7, 1, 3, 2, 3, 0, 1, 5},
        {9, 8, 7, 6, 5, 4, 3, 2, 1, 0}
    };

    for (int i=1;i<9;i++){
        for (int j=1;j<9;j++){
            int x = matrix[i][j];
            if(
                (x<matrix[i-1][j-1]) && 
                (x<matrix[i-1][j]) && 
                (x<matrix[i-1][j+1]) && 
                (x<matrix[i][j-1]) && 
                (x<matrix[i][j+1]) && 
                (x<matrix[i+1][j-1]) &&
                 (x<matrix[i+1][j]) &&
                  (x<matrix[i+1][j+1])
            ){
                cout << "Локальный минимум: " << x
                    << ", строка: " << i + 1
                    << ", столбец: " << j + 1 << endl;
            }

        }
    }
    return 0;
}